results/run36_07.log
Sending build context to Docker daemon   50.1MB
Step 1/16 : FROM ubuntu:16.04
 ---> b9e15a5d1e1a
Step 2/16 : RUN apt-get update &&     apt-get upgrade -y &&     apt-get install -y 	git 	sqlite3 	curl 	make build-essential libssl-dev zlib1g-dev libbz2-dev     libreadline-dev libsqlite3-dev wget curl llvm libncurses5-dev libncursesw5-dev     xz-utils tk-dev libffi-dev liblzma-dev nginx
 ---> Using cache
 ---> 27fd36c0bbed
Step 3/16 : RUN curl -L https://github.com/pyenv/pyenv-installer/raw/master/bin/pyenv-installer | bash
 ---> Using cache
 ---> 8ac9eee594eb
Step 4/16 : ARG PY_VERSION
 ---> Using cache
 ---> d6d9f140a355
Step 5/16 : RUN /root/.pyenv/bin/pyenv install $PY_VERSION
 ---> Using cache
 ---> eea7869dc32f
Step 6/16 : RUN rm -rf /var/lib/apt/lists/*
 ---> Using cache
 ---> f2bad276a584
Step 7/16 : ENV PATH "/root/.pyenv/versions/$PY_VERSION/bin/:${PATH}"
 ---> Using cache
 ---> 8d42b0d5e57a
Step 8/16 : RUN git clone --depth 1 -b 4.1.0 https://github.com/wg/wrk.git /home/wrk &&     make -C /home/wrk > /dev/null
 ---> Using cache
 ---> d709331eac1c
Step 9/16 : ARG REQUIREMENTS
 ---> Using cache
 ---> 04aa0cf95262
Step 10/16 : COPY $REQUIREMENTS /home/src/requirements.txt
 ---> Using cache
 ---> c6f107fca485
Step 11/16 : RUN pip install -r /home/src/requirements.txt
 ---> Using cache
 ---> 6a5c1ba425a4
Step 12/16 : ARG SRC_DIR
 ---> Using cache
 ---> cf8c19e17b0a
Step 13/16 : COPY $SRC_DIR /home/src/
 ---> bf8ebf09339a
Step 14/16 : RUN mv /home/src/db.sqlite3 /home
 ---> Running in 5e2aae7a4e5b
Removing intermediate container 5e2aae7a4e5b
 ---> 83ff42d4f366
Step 15/16 : WORKDIR /home/src/
 ---> Running in b1c73852a700
Removing intermediate container b1c73852a700
 ---> bf904feed5e4
Step 16/16 : ENTRYPOINT /home/src/run.sh
 ---> Running in f95c12a9ada8
Removing intermediate container f95c12a9ada8
 ---> 4cedeb1db9a3
Successfully built 4cedeb1db9a3
Successfully tagged py36:latest
[uWSGI] getting INI configuration from uwsgi.ini
-e 
Check API...
Hello{"summary": "postponed evaluation of type annotations", "description": "In addition, Django applies the following rule: if you set editable=False on the model field, any form created from the model via ModelForm will not include that field.", "project": "treehook", "region": "europe", "total_budget": 650012.5, "info": "To avoid this failure, you must instantiate your", "purpose": "Overriding the default fields", "department": "Salary", "business": "TYYJJB", "is_budget": true, "customer": "jtmoore", "owner": "hqsalmon", "approved_by": "tewagner", "created_at": "2018-09-09T11:46:52.352", "updated_at": "2018-09-09T11:46:52.352", "expires_at": null, "closed": false}  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    10  100    10    0     0   1925      0 --:--:-- --:--:-- --:--:--  2000
django_app
APP django_app is ok

Run wrk...

WRK PING BENCH:
==========================================
Running 1m test @ http://localhost:80
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   326.70us  156.56us   6.03ms   95.99%
    Req/Sec     2.47k   348.90     3.12k    61.67%
  Latency Distribution
     50%  300.00us
     75%  352.00us
     90%  414.00us
     99%  604.00us
  147496 requests in 1.00m, 15.75MB read
  Socket errors: connect 0, read 147495, write 0, timeout 0
Requests/sec:   2458.00
Transfer/sec:    268.84KB

WRK GET BENCH:
==========================================
Running 1m test @ http://localhost:80
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.85ms  393.09us  12.18ms   86.72%
    Req/Sec   496.88     54.84   595.00     63.17%
  Latency Distribution
     50%    1.76ms
     75%    1.98ms
     90%    2.28ms
     99%    3.23ms
  29688 requests in 1.00m, 21.83MB read
  Socket errors: connect 0, read 29688, write 0, timeout 0
Requests/sec:    494.61
Transfer/sec:    372.40KB

WRK PING BENCH:
==========================================
Running 1m test @ http://localhost:80
  4 threads and 60 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.02ms    2.58ms  44.76ms   76.17%
    Req/Sec     2.70k   321.79     4.61k    69.64%
  Latency Distribution
     50%    4.62ms
     75%    6.10ms
     90%    8.00ms
     99%   14.02ms
  644774 requests in 1.00m, 68.87MB read
  Socket errors: connect 0, read 644747, write 0, timeout 0
Requests/sec:  10732.34
Transfer/sec:      1.15MB

WRK GET BENCH:
==========================================
Running 1m test @ http://localhost:80
  4 threads and 60 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.80ms    9.58ms  94.96ms   76.97%
    Req/Sec   565.85     47.19     1.15k    71.30%
  Latency Distribution
     50%   23.00ms
     75%   28.20ms
     90%   38.58ms
     99%   55.57ms
  135287 requests in 1.00m, 99.47MB read
  Socket errors: connect 0, read 135284, write 0, timeout 0
Requests/sec:   2251.09
Transfer/sec:      1.66MB