results/run37_07.log
Sending build context to Docker daemon  50.11MB
Step 1/16 : FROM ubuntu:16.04
 ---> b9e15a5d1e1a
Step 2/16 : RUN apt-get update &&     apt-get upgrade -y &&     apt-get install -y 	git 	sqlite3 	curl 	make build-essential libssl-dev zlib1g-dev libbz2-dev     libreadline-dev libsqlite3-dev wget curl llvm libncurses5-dev libncursesw5-dev     xz-utils tk-dev libffi-dev liblzma-dev nginx
 ---> Using cache
 ---> 27fd36c0bbed
Step 3/16 : RUN curl -L https://github.com/pyenv/pyenv-installer/raw/master/bin/pyenv-installer | bash
 ---> Using cache
 ---> 8ac9eee594eb
Step 4/16 : ARG PY_VERSION
 ---> Using cache
 ---> d6d9f140a355
Step 5/16 : RUN /root/.pyenv/bin/pyenv install $PY_VERSION
 ---> Using cache
 ---> 2feaf9f2f241
Step 6/16 : RUN rm -rf /var/lib/apt/lists/*
 ---> Using cache
 ---> 2a3647cd9a00
Step 7/16 : ENV PATH "/root/.pyenv/versions/$PY_VERSION/bin/:${PATH}"
 ---> Using cache
 ---> 771d8afe5d3e
Step 8/16 : RUN git clone --depth 1 -b 4.1.0 https://github.com/wg/wrk.git /home/wrk &&     make -C /home/wrk > /dev/null
 ---> Using cache
 ---> ef4f36b4234c
Step 9/16 : ARG REQUIREMENTS
 ---> Using cache
 ---> 0995f8894bd4
Step 10/16 : COPY $REQUIREMENTS /home/src/requirements.txt
 ---> Using cache
 ---> ea59eac2561b
Step 11/16 : RUN pip install -r /home/src/requirements.txt
 ---> Using cache
 ---> 148b46d3f247
Step 12/16 : ARG SRC_DIR
 ---> Using cache
 ---> 44c225682725
Step 13/16 : COPY $SRC_DIR /home/src/
 ---> 0fd0f050137a
Step 14/16 : RUN mv /home/src/db.sqlite3 /home
 ---> Running in 85ab2e851507
Removing intermediate container 85ab2e851507
 ---> 02c5ddac5e9c
Step 15/16 : WORKDIR /home/src/
 ---> Running in 9e629276d888
Removing intermediate container 9e629276d888
 ---> a8a159f48eb2
Step 16/16 : ENTRYPOINT /home/src/run.sh
 ---> Running in d9c9cdbfb2a9
Removing intermediate container d9c9cdbfb2a9
 ---> cac844713cf3
Successfully built cac844713cf3
Successfully tagged py37:latest
[uWSGI] getting INI configuration from uwsgi.ini
-e 
Check API...
Hello{"summary": "postponed evaluation of type annotations", "description": "In addition, Django applies the following rule: if you set editable=False on the model field, any form created from the model via ModelForm will not include that field.", "project": "treehook", "region": "europe", "total_budget": 650012.5, "info": "To avoid this failure, you must instantiate your", "purpose": "Overriding the default fields", "department": "Salary", "business": "TYYJJB", "is_budget": true, "customer": "jtmoore", "owner": "hqsalmon", "approved_by": "tewagner", "created_at": "2018-09-09T11:46:52.352", "updated_at": "2018-09-09T11:46:52.352", "expires_at": null, "closed": false}  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    10  100    10    0     0   1906      0 --:--:-- --:--:-- --:--:--  2000
django_app
APP django_app is ok

Run wrk...

WRK PING BENCH:
==========================================
Running 1m test @ http://localhost:80
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   279.37us  144.80us   5.90ms   96.60%
    Req/Sec     2.83k   350.06     3.36k    65.67%
  Latency Distribution
     50%  253.00us
     75%  294.00us
     90%  349.00us
     99%  534.00us
  169287 requests in 1.00m, 18.08MB read
  Socket errors: connect 0, read 169286, write 0, timeout 0
Requests/sec:   2821.12
Transfer/sec:    308.56KB

WRK GET BENCH:
==========================================
Running 1m test @ http://localhost:80
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.71ms  362.85us  12.23ms   85.45%
    Req/Sec   534.76     60.95   646.00     65.17%
  Latency Distribution
     50%    1.62ms
     75%    1.83ms
     90%    2.13ms
     99%    2.96ms
  31950 requests in 1.00m, 23.49MB read
  Socket errors: connect 0, read 31949, write 0, timeout 0
Requests/sec:    532.34
Transfer/sec:    400.81KB

WRK PING BENCH:
==========================================
Running 1m test @ http://localhost:80
  4 threads and 60 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.64ms    4.40ms 207.91ms   94.45%
    Req/Sec     2.93k   378.10     4.38k    68.59%
  Latency Distribution
     50%    4.07ms
     75%    5.59ms
     90%    7.62ms
     99%   14.09ms
  700648 requests in 1.00m, 74.84MB read
  Socket errors: connect 0, read 700620, write 0, timeout 0
Requests/sec:  11668.67
Transfer/sec:      1.25MB

WRK GET BENCH:
==========================================
Running 1m test @ http://localhost:80
  4 threads and 60 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.98ms    9.18ms 100.65ms   77.27%
    Req/Sec   611.31     50.39     1.12k    70.27%
  Latency Distribution
     50%   20.81ms
     75%   26.82ms
     90%   35.40ms
     99%   52.93ms
  146178 requests in 1.00m, 107.48MB read
  Socket errors: connect 0, read 146173, write 0, timeout 0
Requests/sec:   2433.01
Transfer/sec:      1.79MB